reading dataset

In [114]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [115]:
df =pd.read_csv("../datasets/agricultural_dataset.csv")
df.head(10)

,commodity_name,state,district,market,min_price,max_price,modal_price,date
0,Ajwan,Gujarat,Amreli,Amreli,63.25,79.55,79.55,2019-05-22
1,Ajwan,Gujarat,Banaskanth,Dhanera,80.05,80.05,80.05,2019-05-22
2,Ajwan,Gujarat,Jamnagar,Jamnagar,90.00,155.00,122.50,2019-05-22
3,Ajwan,Gujarat,Mehsana,Kadi,94.50,112.50,107.00,2019-05-22
4,Ajwan,Gujarat,Mehsana,Unjha,21.25,148.50,99.75,2019-05-22
5,Ajwan,Madhya Pradesh,Neemuch,Neemuch,80.00,132.00,95.00,2019-05-22
6,Ajwan,Rajasthan,Chittorgarh,Nimbahera,9.77,9.95,9.80,2019-05-22
7,Ajwan,Rajasthan,Chittorgarh,Pratapgarh,100.50,120.90,110.70,2019-05-22
8,Alasande+Gram,Karnataka,Bagalkot,Bagalakot,46.01,46.50,46.46,2019-05-22
9,Alasande+Gram,Karnataka,Bangalore,Bangalore,48.00,53.00,50.50,2019-05-22

In [116]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 836977 entries, 0 to 836976
Data columns (total 8 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   commodity_name  836976 non-null  object
 1   state           836977 non-null  object
 2   district        836977 non-null  object
 3   market          836977 non-null  object
 4   min_price       836976 non-null  float64
 5   max_price       836976 non-null  float64
 6   modal_price     836976 non-null  float64
 7   date            836976 non-null  object
dtypes: float64(3), object(5)
memory usage: 51.1+ MB

### Feature Engineering

In [117]:
df.isna().sum()

commodity_name    1
state             0
district          0
market            0
min_price         1
max_price         1
modal_price       1
date              1
dtype: int64

In [118]:
df[df.isnull().any(axis=1)]

,commodity_name,state,district,market,min_price,max_price,modal_price,date
834337,its,1.50,3000,5000,NaN,NaN,NaN,NaN
834417,NaN,Uttar Pradesh,Kanpur,Kanpur(Grain),6600.0,6800.0,6700.0,12 Oct 2021

In [119]:
df = df.dropna().reset_index(drop=True)

In [120]:
df.isna().sum()

commodity_name    0
state             0
district          0
market            0
min_price         0
max_price         0
modal_price       0
date              0
dtype: int64

In [121]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 836975 entries, 0 to 836974
Data columns (total 8 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   commodity_name  836975 non-null  object
 1   state           836975 non-null  object
 2   district        836975 non-null  object
 3   market          836975 non-null  object
 4   min_price       836975 non-null  float64
 5   max_price       836975 non-null  float64
 6   modal_price     836975 non-null  float64
 7   date            836975 non-null  object
dtypes: float64(3), object(5)
memory usage: 51.1+ MB

In [122]:
df['commodity_name'].value_counts()

commodity_name
Onion            44908
Tomato           42715
Wheat            41172
Potato           37810
Brinjal          33687
                 ...
Butter               3
Lukad                2
Almond(Badam)        1
Sunhemp              1
Siddota              1
Name: count, Length: 248, dtype: int64

In [123]:
df.iloc[0]

commodity_name         Ajwan
state                Gujarat
district              Amreli
market                Amreli
min_price              63.25
max_price              79.55
modal_price            79.55
date              2019-05-22
Name: 0, dtype: object

In [124]:
from sklearn.preprocessing import LabelEncoder

le_commodity_name = LabelEncoder()

df['commodity_name'] = le_commodity_name.fit_transform(df['commodity_name'])

In [125]:
df.head()

,commodity_name,state,district,market,min_price,max_price,modal_price,date
0,0,Gujarat,Amreli,Amreli,63.25,79.55,79.55,2019-05-22
1,0,Gujarat,Banaskanth,Dhanera,80.05,80.05,80.05,2019-05-22
2,0,Gujarat,Jamnagar,Jamnagar,90.00,155.00,122.50,2019-05-22
3,0,Gujarat,Mehsana,Kadi,94.50,112.50,107.00,2019-05-22
4,0,Gujarat,Mehsana,Unjha,21.25,148.50,99.75,2019-05-22

In [ ]:
le_state = LabelEncoder()
df['state'] = le_state.fit_transform(df['state'])

In [127]:
df.head()

,commodity_name,state,district,market,min_price,max_price,modal_price,date
0,0,5,Amreli,Amreli,63.25,79.55,79.55,2019-05-22
1,0,5,Banaskanth,Dhanera,80.05,80.05,80.05,2019-05-22
2,0,5,Jamnagar,Jamnagar,90.00,155.00,122.50,2019-05-22
3,0,5,Mehsana,Kadi,94.50,112.50,107.00,2019-05-22
4,0,5,Mehsana,Unjha,21.25,148.50,99.75,2019-05-22

In [128]:
le_district=LabelEncoder()
df['district']=le_district.fit_transform(df['district'])

In [129]:
df.head()

,commodity_name,state,district,market,min_price,max_price,modal_price,date
0,0,5,15,Amreli,63.25,79.55,79.55,2019-05-22
1,0,5,39,Dhanera,80.05,80.05,80.05,2019-05-22
2,0,5,206,Jamnagar,90.00,155.00,122.50,2019-05-22
3,0,5,304,Kadi,94.50,112.50,107.00,2019-05-22
4,0,5,304,Unjha,21.25,148.50,99.75,2019-05-22

In [ ]:
le_market = LabelEncoder()
df['market'] = le_market.fit_transform(df['market'])

In [131]:
df.head()

,commodity_name,state,district,market,min_price,max_price,modal_price,date
0,0,5,15,78,63.25,79.55,79.55,2019-05-22
1,0,5,39,593,80.05,80.05,80.05,2019-05-22
2,0,5,206,934,90.00,155.00,122.50,2019-05-22
3,0,5,304,999,94.50,112.50,107.00,2019-05-22
4,0,5,304,2278,21.25,148.50,99.75,2019-05-22

In [132]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 836975 entries, 0 to 836974
Data columns (total 8 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   commodity_name  836975 non-null  int64
 1   state           836975 non-null  int64
 2   district        836975 non-null  int64
 3   market          836975 non-null  int64
 4   min_price       836975 non-null  float64
 5   max_price       836975 non-null  float64
 6   modal_price     836975 non-null  float64
 7   date            836975 non-null  object
dtypes: float64(3), int64(4), object(1)
memory usage: 51.1+ MB

In [133]:
top_date = df.iloc[:825914]['date'].str.split('-',expand= True)
top_date.rename(columns= {0:'year',1:'month',2:'date'},inplace=True)
top_date.head()

   year month date
0  2019    05   22
1  2019    05   22
2  2019    05   22
3  2019    05   22
4  2019    05   22

In [134]:
bot_date = df.iloc[825914:]['date'].str.split(expand= True)
bot_date.rename(columns= {0:'date',1:'month',2:'year'},inplace=True)
bot_date['month']='10'
bot_date.head()

       date month  year
825914   27    10  2021
825915   27    10  2021
825916   27    10  2021
825917   05    10  2021
825918   05    10  2021

In [135]:
new_date = pd.concat([top_date,bot_date])
new_date['month'].value_counts()

month
07    130519
05     91643
09     89001
10     87838
08     83178
11     82289
12     80933
06     78501
03     63723
04     49350
Name: count, dtype: int64

In [136]:
df.drop(columns=['date'],inplace=True)
df = pd.concat([df,new_date],axis=1)
df.tail()

,commodity_name,state,district,market,min_price,max_price,modal_price,year,month,date
836970,14,5,63,930,5100.0,5500.0,5300.0,2021,10,06
836971,14,5,378,942,3500.0,5500.0,5000.0,2021,10,06
836972,14,5,378,1832,5300.0,6225.0,5650.0,2021,10,06
836973,14,5,219,2352,4750.0,5750.0,5250.0,2021,10,06
836974,14,11,239,1595,10500.0,11500.0,11000.0,2021,10,06

In [140]:
df['date'] = df['date'].astype(int)
df['month'] = df['month'].astype(int)
df['year'] = df['year'].astype(int)

In [141]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 836975 entries, 0 to 836974
Data columns (total 10 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   commodity_name  836975 non-null  int64
 1   state           836975 non-null  int64
 2   district        836975 non-null  int64
 3   market          836975 non-null  int64
 4   min_price       836975 non-null  float64
 5   max_price       836975 non-null  float64
 6   modal_price     836975 non-null  float64
 7   year            836975 non-null  int64
 8   month           836975 non-null  int64
 9   date            836975 non-null  int64
dtypes: float64(3), int64(7)
memory usage: 63.9 MB

In [146]:
df.corr()['modal_price']

commodity_name   -0.107382
state            -0.029918
district          0.003948
market            0.010154
min_price         0.691707
max_price         0.755211
modal_price       1.000000
year              0.107744
month             0.059459
date             -0.002269
Name: modal_price, dtype: float64

In [ ]:
# from sklearn.model_selection import train_test_split

# X = df.drop(columns=['min_price','max_price','modal_price'])
# y = df['modal_price']

# X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.25,random_state=42)